Tekla Open API Reference for Tekla Structures 2025
WorkPlaneHandler Class
 The WorkPlaneHandler class contains methods for getting and setting the current transformation plane.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.WorkPlaneHandler
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class WorkPlaneHandler
<SerializableAttribute>
Public NotInheritable Class WorkPlaneHandler
The WorkPlaneHandler type exposes the following members.
Methods
Name | Description
GetCurrentTransformationPlane
 Gets the current transformation plane.
SetCurrentTransformationPlane
 Sets the current transformation plane.
Top
See Also
Reference
Tekla.Structures.Model Namespace